In [45]:
# Received an error about the package, google said try this, VSCode says its there already, i thought it was so maybe i started off in the wrong space.
#pip install SQLAlchemy Flask-SQLAlchemy

In [72]:
#imported this but don't know what else I need
from sqlalchemy import create_engine
import pandas as pd
import geopandas as gpd
import matplotlib as plt
from shapely.geometry import point

In [47]:
#Connection string, so python can access sql table/data
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [48]:
#create a variable for sql data
engine = create_engine(connection_string, query_cache_size=1200)

In [49]:
#1eda: Are there any null values?
#check first table SCOOTERS for missing values, appears CHARGELEVEL is the only column with null values
#yes - chargelevel has 770 difference from all the other columns listed

query1_eda = '''
SELECT COUNT(pubdatetime) AS pubdatetime, COUNT(latitude) AS lat, COUNT(longitude) AS lon, COUNT(sumdid) AS sumdid, COUNT(sumdtype) AS sumdtype, COUNT(chargelevel) AS chargelevel, 
COUNT(sumdgroup) AS sumdgroup, COUNT(costpermin) AS costpermin, COUNT(companyname) AS company
FROM scooters;
'''

pd.read_sql(query1_eda, con = engine)

,pubdatetime,lat,lon,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,company
0,73414043,73414043,73414043,73414043,73414043,73413273,73414043,73414043,73414043

In [50]:
#check second table TRIPS to see if there are any missing values, and there are not. 
query1a_eda= '''
SELECT COUNT(pubtimestamp) AS pubtimestamp, COUNT(companyname) AS companyname, COUNT(triprecordnum) AS tripnum, COUNT(sumdid) AS sumdid, COUNT(tripduration) AS tripduration, 
COUNT(tripdistance) AS tripdistance, COUNT(startdate) AS startdate, COUNT(starttime) AS starttime, COUNT(enddate) AS enddate, COUNT(endtime) AS endtime, COUNT(startlatitude) AS startlat,
COUNT(startlongitude) AS startlong, COUNT(endlatitude) AS endlat, COUNT(endlongitude) AS endlong, COUNT(triproute) AS triproute, COUNT(create_dt) AS create_dt
FROM trips;
'''
pd.read_sql(query1a_eda, con=engine)

,pubtimestamp,companyname,tripnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlat,startlong,endlat,endlong,triproute,create_dt
0,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522

In [51]:
#2eda :What is the Date range represented in each of the date columns - investigate any that seem odd.
#scooters table
query2_eda = '''
SELECT MIN(pubdatetime) AS mindate, MAX(pubdatetime) AS maxdate
FROM scooters;
'''
pd.read_sql(query2_eda, con = engine)

#earliest date 05/01/2019
#latest date 07/31/2019

                  mindate             maxdate
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [52]:
#check second table for earliest and latest dates
#trips table

query2a_eda = '''
SELECT 
MIN(pubtimestamp) AS min_ptstamp,MAX(pubtimestamp) AS max_ptstamp, 
MIN(startdate) AS min_startdate, MAX(startdate) AS max_startdate, 
MIN(enddate) AS min_enddate, MAX(enddate) AS max_enddate
FROM trips;
'''

pd.read_sql(query2a_eda, con = engine)
# earliest date I see is 05/01/2019 and absolute latest date i see is 08/01/2019

,min_ptstamp,max_ptstamp,min_startdate,max_startdate,min_enddate,max_enddate
0,2019-05-01 00:00:55.423,2019-08-01 07:04:00,2019-05-01,2019-07-31,2019-05-01,2019-08-01

In [53]:
#3eda: Is time represented with am/pm or using 24 hour values in each of the columns that include time?
#looking above at results, time is represented in 24 hour values for the pubdatetime column in scooters and trip table

In [62]:
#4eda: What values are there in the sumdgroup column? Are there any that are not of interest for this project?
query4a_eda = '''
SELECT DISTINCT(sumdgroup)
FROM scooters
LIMIT 20;
'''
pd.read_sql(query4a_eda, con = engine)
#print(query4a_eda)
#print(type(query4a_eda))

#values are string - results are Scooter, scooter, and bicylce (which is not of interest).

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [69]:
#5eda: What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
#without plotting to see a visual, i think its odd that for the this first query I got 0.00
query5a_eda = '''
SELECT MIN(latitude), MAX(longitude)
FROM scooters;
'''
pd.read_sql(query5a_eda, con = engine)

   min  max
0  0.0  0.0

In [75]:
query5b_eda = '''
SELECT 
MIN(startlatitude) AS min_startlat, MAX(startlatitude) AS max_startlat,
MIN(endlatitude) AS min_endlat, MAX(endlatitude) AS max_endlat,
MIN(startlongitude) AS min_startlon, MAX(startlongitude) AS max_startlon,
MIN(endlongitude) AS min_endlon, MAX(endlongitude) AS max_endlon
FROM trips;
'''
pd.read_sql(query5b_eda, con = engine)

,min_startlat,max_startlat,min_endlat,max_endlat,min_startlon,max_startlon,min_endlon,max_endlon
0,35.8532,36.300029,-36.850405,51.045409,-86.918008,-86.3662,-122.673729,174.764886

In [86]:
#6eda : What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
#is this supposed to be a window function?

query6a_eda = '''
SELECT companyname, COUNT(DISTINCT triprecordnum) AS tr_num_bygrp
FROM trips
GROUP BY companyname;
'''
pd.read_sql(query6a_eda, con = engine)

     companyname  tr_num_bygrp
0           Bird         10868
1  Bolt Mobility          1232
2         Gotcha           187
3           JUMP           850
4           Lime         50656
5           Lyft          3582
6           SPIN          1597

In [80]:
#7eda : Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?
# The naming convention is slightly different for the companynames from the trips table. Tried union and it does not reflect this. 
query7a_eda = '''
SELECT DISTINCT(companyname)
FROM scooters;
'''
pd.read_sql(query7a_eda, con = engine)

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [82]:
query7b_eda = '''
SELECT DISTINCT(companyname)
FROM trips;
'''
pd.read_sql(query7b_eda, con = engine)

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

#1. During this period, seven companies offered scooters.

In [88]:
 #A :How many scooters did each company have in this time frame? 

query1A = '''
SELECT companyname, COUNT(DISTINCT sumdid)
FROM scooters
GROUP BY companyname
'''
pd.read_sql(query1A, con = engine)

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824
5        Lyft   1735
6        Spin    805

In [ ]:
#B :Did the number for each company change over time? 
query1B = '''
SELECT companyname, COUNT(DISTINCT sumdid)/Extract

In [89]:
#C :Did scooter usage vary by company?
#this query is pulling the company name and the sum of all tripduration (in minutes)/ grouped by the companyname
query1C = '''
SELECT companyname, ROUND(SUM(tripduration),2) AS sum_tripduration_perco
FROM trips
GROUP BY companyname;
'''
pd.read_sql(query1C, con = engine)

     companyname  sum_tripduration_perco
0           Bird              2046202.00
1  Bolt Mobility             30821497.00
2         Gotcha                33802.78
3           JUMP               211001.30
4           Lime              3507335.40
5           Lyft              1936369.53
6           SPIN               900575.00

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:

In [ ]:
#1 Removal of staff servicing and test trips  
#2 Removal of trips below one minute  
#3 Trip lengths are capped at 24 hours